Tekla Open API Reference for Tekla Structures 2025
EmbeddedObjectFrame Class
 The EmbeddedObjectFrame class defines the frame object for embedded objects.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.EmbeddedObjectFrame
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class EmbeddedObjectFrame : IAxisAlignedBoundingBox,
	IObjectAlignedBoundingBox, IIsEqual
<SerializableAttribute>
Public NotInheritable Class EmbeddedObjectFrame
	Implements IAxisAlignedBoundingBox, IObjectAlignedBoundingBox, IIsEqual
The EmbeddedObjectFrame type exposes the following members.
Constructors
Name | Description
EmbeddedObjectFrame(LineTypes, DrawingColors)
 Creates a new embedded object frame instance with the specified line type and color.
EmbeddedObjectFrame(LineTypes, TeklaDrawingColor)
 Creates a new embedded object frame instance with the specified line type and user defined RGB color.
Top
Properties
Name | Description
Color |  Obsolete.
Line
 Gets or sets the line type of the frame.
LineType |  Obsolete.
Type
 Gets the frame type (rectangular).
Top
Methods
Name | Description
GetAxisAlignedBoundingBox
 Returns the bounding box of the frame in the global axis coordinate system.
GetObjectAlignedBoundingBox
 Returns the bounding box of the frame in the local coordinate system.
IsEqual
 Compares the current object with an object of the same type.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace